<?php 
	@header("Content-Type:text/html; charset=utf-8");
		require_once("function/global_function.php");
		

        $tt = '[
 {
 "民宿登記證編號": "1",
 "中文名稱": "古木拉民宿",
 "英文名稱": "Ku Mu La Homestay",
 "聯絡電話": "07-6801868",
 "傳真": "07-6801172",
 "民宿中文地址": "851高雄市茂林區多納里90-2號",
 "英文地址": "No.90-2， Duona Village， Maulin District， Kaohsiung City 851， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "2",
 "中文名稱": "阿拉斯民宿",
 "英文名稱": "",
 "聯絡電話": "07-6801277",
 "傳真": "-",
 "民宿中文地址": "851高雄市茂林區多納里2鄰32號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "4",
 "中文名稱": "友生民宿",
 "英文名稱": "",
 "聯絡電話": "07-6801101",
 "傳真": "07-6801101",
 "民宿中文地址": "851高雄市茂林區多納里2鄰30-1號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "7",
 "中文名稱": "草地人民宿",
 "英文名稱": "C.D.R. HOTSPRING HOLIDAY CENTRE",
 "聯絡電話": "07-6791736，6791992",
 "傳真": "-",
 "民宿中文地址": "844高雄市六龜區新發里新開路33-1號",
 "英文地址": "No.33-1， Sinkai Rd.， Liouguei District， Kaohsiung City 844， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "8",
 "中文名稱": "亞力民宿",
 "英文名稱": "YaLi B&B",
 "聯絡電話": "07-6882042",
 "傳真": "07-6881915",
 "民宿中文地址": "848高雄市桃源區建山巷86-2號",
 "英文地址": "No.86-2， Jianshan Ln.， Taoyuan Dist.， Kaohsiung City 848， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "11",
 "中文名稱": "人字山莊",
 "英文名稱": "Ran-Ge B & B",
 "聯絡電話": "07-6822159",
 "傳真": "-",
 "民宿中文地址": "843高雄市美濃區民權路66-5號",
 "英文地址": "No.66-5， Mincyuan Rd.， Meinong District， Kaohsiung City 843， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "12",
 "中文名稱": "麥克亞倫渡假村",
 "英文名稱": "Mike Allan Resort",
 "聯絡電話": "07-6791383",
 "傳真": "-",
 "民宿中文地址": "844高雄市六龜區新發里和平路130-5號",
 "英文地址": "No.130-5， Heping Rd.， Liouguei District， Kaohsiung City 844， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "13",
 "中文名稱": "梅蘭山莊",
 "英文名稱": "HAL-LAN VILLAGE RESORT Homestay",
 "聯絡電話": "07-6866039",
 "傳真": "07-6866269",
 "民宿中文地址": "848高雄市桃源區梅蘭里南橫公路五段222號",
 "英文地址": "No.222， Sec. 5， Nanhenggong Rd.， Taoyuan Dist.， Kaohsiung City 848， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "14",
 "中文名稱": "中正湖民宿",
 "英文名稱": "Jhong Jheng Hu B&B",
 "聯絡電話": "07-6812736",
 "傳真": "07-6813783",
 "民宿中文地址": "843高雄市美濃區福美路30號",
 "英文地址": "No.30， Fumei Rd.， Meinong District， Kaohsiung City 843， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "15",
 "中文名稱": "湖美茵/快樂/天然",
 "英文名稱": "Farmin Happy Nature",
 "聯絡電話": "07-6812255",
 "傳真": "07-6817828",
 "民宿中文地址": "843高雄市美濃區中山路2段782巷52號",
 "英文地址": "No.52， Ln. 782， Sec. 2， Zhongshan Rd.， Meinong District， Kaohsiung City 843， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "16",
 "中文名稱": "山下華園",
 "英文名稱": "Shan-Hsia villa Homestay",
 "聯絡電話": "07-6891888",
 "傳真": "07-6892788",
 "民宿中文地址": "844高雄市六龜區中興里尾庄68-68號",
 "英文地址": "No.68-68， Weizhuang， Liugui District， Kaohsiung City 844， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "22",
 "中文名稱": "月光山香草民宿休閒山莊",
 "英文名稱": "",
 "聯絡電話": "07-6772586",
 "傳真": "-",
 "民宿中文地址": "846高雄市杉林區桐竹路208-2號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "23",
 "中文名稱": "頭前園民宿",
 "英文名稱": "Jou chian yuan bed and breakfast",
 "聯絡電話": "07-6366688",
 "傳真": "07-6366688",
 "民宿中文地址": "823高雄市田寮區崇德里崇德路9號",
 "英文地址": "No.9， Chongde Rd.， Tianliao District， Kaohsiung City 823， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "24",
 "中文名稱": "梅礦民宿",
 "英文名稱": "",
 "聯絡電話": "07-6883330",
 "傳真": "-",
 "民宿中文地址": "844高雄市六龜區寶來里竹林路65-31號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "25",
 "中文名稱": "松柏林民宿",
 "英文名稱": "songbolin Hotel",
 "聯絡電話": "07-6891010",
 "傳真": "07-6895715",
 "民宿中文地址": "844高雄市六龜區興龍里3鄰37-8號",
 "英文地址": "No.37-8.Tulog.shingLong Village.Liugui Dist Kaohsiung city.Taiwan"
 },
 {
 "民宿登記證編號": "26",
 "中文名稱": "得恩谷?民宿",
 "英文名稱": "",
 "聯絡電話": "07-6801540",
 "傳真": "07-6801539",
 "民宿中文地址": "851高雄市茂林區茂林里6鄰138號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "27",
 "中文名稱": "百果園民宿",
 "英文名稱": "",
 "聯絡電話": "07-6818587",
 "傳真": "-",
 "民宿中文地址": "843高雄市美濃區復興街1段58巷5號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "28",
 "中文名稱": "木森林香草民宿",
 "英文名稱": "",
 "聯絡電話": "07-6895866，6895021",
 "傳真": "07-6894487，6895658",
 "民宿中文地址": "844高雄市六龜區興龍里舊潭21-1號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "29",
 "中文名稱": "扇平山莊(民宿)",
 "英文名稱": "",
 "聯絡電話": "07-6895882",
 "傳真": "07-6895838",
 "民宿中文地址": "844高雄市六龜區中興里尾庄45-3號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "30",
 "中文名稱": "自強民宿",
 "英文名稱": "Tzu-Chiang Peoples Hostel",
 "聯絡電話": "07-6810621",
 "傳真": "07-6810621",
 "民宿中文地址": "843高雄市美濃區自強街1段316號",
 "英文地址": "No.316， Sec. 1， Ziqiang St.， Meinong District， Kaohsiung City 843， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "31",
 "中文名稱": "美濃民宿",
 "英文名稱": "Meinung Peoples Hostel",
 "聯絡電話": "07-6810621",
 "傳真": "07-68822476",
 "民宿中文地址": "843高雄市美濃區自強街1段318號",
 "英文地址": "No.318， Sec. 1， Ziqiang St.， Meinong District， Kaohsiung City 843， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "32",
 "中文名稱": "清園民宿",
 "英文名稱": "Cheen-uan Peoples Hostel",
 "聯絡電話": "07-6810621",
 "傳真": "07-6822476",
 "民宿中文地址": "843高雄市美濃區自強路1段320號",
 "英文地址": "No.320， Sec. 1， Ziqiang St.， Meinong District， Kaohsiung City 843， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "33",
 "中文名稱": "峰園民宿",
 "英文名稱": "",
 "聯絡電話": "07-6820839",
 "傳真": "-",
 "民宿中文地址": "843高雄市美濃區雙峰街8-20號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "35",
 "中文名稱": "達妮芙民宿",
 "英文名稱": "",
 "聯絡電話": "07-6866012",
 "傳真": "07-6861297",
 "民宿中文地址": "848高雄市桃源區梅蘭里梅蘭巷177號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "36",
 "中文名稱": "林家民宿",
 "英文名稱": "",
 "聯絡電話": "07-6820658",
 "傳真": "-",
 "民宿中文地址": "843高雄市美濃區民族路53-7號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "37",
 "中文名稱": "美濃雲山居民宿",
 "英文名稱": "",
 "聯絡電話": "07-6833808",
 "傳真": "-",
 "民宿中文地址": "843高雄市美濃區龍山街56-1號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "38",
 "中文名稱": "土夏生機花園民宿",
 "英文名稱": "",
 "聯絡電話": "07-6791000",
 "傳真": "07-6791350",
 "民宿中文地址": "844高雄市六龜區新發里和平路130-72號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "40",
 "中文名稱": "旗山民宿",
 "英文名稱": "",
 "聯絡電話": "0918-183715",
 "傳真": "07-6618983",
 "民宿中文地址": "842高雄市旗山區三協里楊厝巷11-1號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "41",
 "中文名稱": "山水炎民宿",
 "英文名稱": "",
 "聯絡電話": "07-6891257",
 "傳真": "-",
 "民宿中文地址": "844高雄市六龜區中興里尾庄55之2號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "42",
 "中文名稱": "日景園",
 "英文名稱": "",
 "聯絡電話": "07-6891317",
 "傳真": "07-6894113",
 "民宿中文地址": "844高雄市六龜區文武里光明巷37-1號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "43",
 "中文名稱": "旗山三合院民宿",
 "英文名稱": "",
 "聯絡電話": "0919-106412",
 "傳真": "-",
 "民宿中文地址": "842高雄市旗山區廣福里中興街6號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "45",
 "中文名稱": "中正湖歐式山莊",
 "英文名稱": "",
 "聯絡電話": "07-6812736",
 "傳真": "07-6817783",
 "民宿中文地址": "843高雄市美濃區福美路28號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "47",
 "中文名稱": "菸城民宿",
 "英文名稱": "Tobacco City Guest",
 "聯絡電話": "07-6851110",
 "傳真": "07-6851981",
 "民宿中文地址": "843高雄市美濃區中華路7巷17號",
 "英文地址": "No.17， Ln. 7， Zhonghua Rd.， Meinong District， Kaohsiung City 843， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "48",
 "中文名稱": "妞妞與夢卡民宿",
 "英文名稱": "",
 "聯絡電話": "07-6881725",
 "傳真": "-",
 "民宿中文地址": "844高雄市六龜區寶來里中正路16號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "49",
 "中文名稱": "雅砌民宿",
 "英文名稱": "",
 "聯絡電話": "07-2821787",
 "傳真": "-",
 "民宿中文地址": "844高雄市六龜區荖濃里南橫路132號(聯絡地址：高雄市三民區市中一路384巷89號)",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "51",
 "中文名稱": "月灣森林villa民宿",
 "英文名稱": "",
 "聯絡電話": "07-6882225",
 "傳真": "07-6882354",
 "民宿中文地址": "848高雄市桃源區勤和里南橫公路3段333號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "52",
 "中文名稱": "布農星宿民宿",
 "英文名稱": "",
 "聯絡電話": "07-7352259",
 "傳真": "07-7320429",
 "民宿中文地址": "848高雄市桃源區寶山里寶山巷19-8號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "53",
 "中文名稱": "美濃情休閒觀光民宿",
 "英文名稱": "",
 "聯絡電話": "07-6811368",
 "傳真": "-",
 "民宿中文地址": "843高雄市美濃區祿興里上竹圍14號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "54",
 "中文名稱": "巴尼.蓋休閒農莊民宿",
 "英文名稱": "",
 "聯絡電話": "07-6701926",
 "傳真": "-",
 "民宿中文地址": "849高雄市那瑪夏區瑪雅里平和巷202號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "55",
 "中文名稱": "花旗山莊民宿",
 "英文名稱": "",
 "聯絡電話": "07-6624416，6623824",
 "傳真": "-",
 "民宿中文地址": "842高雄市旗山區三協里成功街1號及2號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "59",
 "中文名稱": "旗?民宿山莊",
 "英文名稱": "",
 "聯絡電話": "07-6822577",
 "傳真": "07-3357779",
 "民宿中文地址": "842高雄市旗山區東平里13鄰樹人路199巷51號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "60",
 "中文名稱": "星旺民宿山莊",
 "英文名稱": "",
 "聯絡電話": "07-6895449",
 "傳真": "-",
 "民宿中文地址": "844高雄市六龜區文武里復興巷37-8號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "61",
 "中文名稱": "美綠民宿",
 "英文名稱": "",
 "聯絡電話": "07-6851111",
 "傳真": "-",
 "民宿中文地址": "843高雄市美濃區獅山里竹門14-2號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "62",
 "中文名稱": "旗山麗景民宿",
 "英文名稱": "",
 "聯絡電話": "07-6621965",
 "傳真": "-",
 "民宿中文地址": "842高雄市旗山區上洲里中洲路溝底巷1-3號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "63",
 "中文名稱": "老頭民宿",
 "英文名稱": "olddady B&B",
 "聯絡電話": "07-3412718",
 "傳真": "-",
 "民宿中文地址": "842高雄市旗山區三協里花旗二路11巷6號",
 "英文地址": "No.6， Ln. 11， Huaqi 2nd Rd.， Qishan Dist.， Kaohsiung City 842， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "64",
 "中文名稱": "大樹南瓜屋-義大別莊",
 "英文名稱": "DASU PUMPKIN HOUSE",
 "聯絡電話": "07-7515754",
 "傳真": "-",
 "民宿中文地址": "840高雄市大樹區三和里學城路一段8巷86號",
 "英文地址": "No.86， Ln. 8， Sec. 1， Xuecheng Rd.， Dashu Dist.， Kaohsiung City 840， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "65",
 "中文名稱": "寧妮谷民宿",
 "英文名稱": "Ningni Guest House",
 "聯絡電話": "07-6701087",
 "傳真": "-",
 "民宿中文地址": "84941高雄市那瑪夏區達卡努瓦里3鄰秀嶺巷183號",
 "英文地址": "No.183， Xiuling Ln.， Namaxia Dist.， Kaohsiung City 849， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "66",
 "中文名稱": "愛至民宿",
 "英文名稱": "Love to",
 "聯絡電話": "07-6626964(0912-165145)",
 "傳真": "-",
 "民宿中文地址": "842高雄市旗山區三協里成功一街7，8號",
 "英文地址": "No.7，8， Chenggong 1st St.， Qishan Dist.， Kaohsiung City 842， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "67",
 "中文名稱": "一家人本舖",
 "英文名稱": "Sweet Home",
 "聯絡電話": "07-6892007 0975055633",
 "傳真": "07-7410333",
 "民宿中文地址": "848高雄市桃源區寶山里7鄰寶山巷88之6號",
 "英文地址": "No.88-6， Baoshan Ln.， Baoshan Township，Taoyuan Dist Kaohsiung City 848， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "68",
 "中文名稱": "竹亮山莊",
 "英文名稱": "",
 "聯絡電話": "07-6673963",
 "傳真": "-",
 "民宿中文地址": "845高雄市內門區竹戈寮8之3號",
 "英文地址": ""
 },
 {
 "民宿登記證編號": "69",
 "中文名稱": "明山莊",
 "英文名稱": "Mingshan Villa",
 "聯絡電話": "07-6563891",
 "傳真": "-",
 "民宿中文地址": "840高雄市大樹區三和里三和路120-1號",
 "英文地址": "No.120-1， Sanhe Rd.， Dashu Dist.， Kaohsiung City 840， Taiwan (R.O.C.)"
 },
 {
 "民宿登記證編號": "70",
 "中文名稱": "喜樂莊園",
 "英文名稱": "Rejoice Manor",
 "聯絡電話": "07-3560221",
 "傳真": "-",
 "民宿中文地址": "815高雄市大社區學府路225巷6弄6號",
 "英文地址": "No.6， Aly. 6， Ln. 225， Xuefu Rd.， Dashe Dist.， Kaohsiung City 815， Taiwan ( R.O.C.)"
 }
 ]';//先自己宣告一個json 格式

		//$tt = $_POST['JData']; //這個是到時候重android端接值時要用到的，現在用不到所以先註解
        $cart = json_decode($tt,true); //這個地方是在解析json
        $con = count($cart);
        //print_r( $cart); // 你可以先看這個就可以知道json 剖析出來的陣列內容
        
        echo  $cart[0]["民宿登記證編號"]; //像是這樣就可以單獨顯示 陣列裡的內容
        echo  $cart[0]["中文名稱"];
        echo  $cart[0]["英文名稱"];
        echo  $cart[0]["聯絡電話"];
        echo  $cart[0]["傳真"];
        echo  $cart[0]["民宿中文地址"];
        echo  $cart[0]["英文地址"];

        for ($i = 0 ; $i < $con ; $i++) { 
            $data = array('0' =>$cart[$i]["民宿登記證編號"] ,'1' =>$cart[$i]["中文名稱"] ,'2' =>$cart[$i]["英文名稱"] ,'3' =>$cart[$i]["聯絡電話"] ,'4' =>$cart[$i]["傳真"] ,'5' =>$cart[$i]["民宿中文地址"] ,'6' =>$cart[$i]["英文地址"]);
            //這個就是把你要寫到資料庫的資料丟到陣列
            $users = sqlEdit("INSERT INTO hotel (`b_id`,`h_name_chinese`,`h_name_english`,`h_tel`,`h_fax`,`h_address_chinese`,`h_address_english`) VALUES(?,?,?,?,?,?,?)",$data);
            // echo "1";
        }
